//清音のテーブル
export const hiraganaTable: { [key: string]: number } = {
  あ: 0x01,
  い: 0x03,
  う: 0x09,
  え: 0x0b,
  お: 0x0a,
  か: 0x21,
  き: 0x23,
  く: 0x29,
  け: 0x2b,
  こ: 0x2a,
  さ: 0x31,
  し: 0x33,
  す: 0x39,
  せ: 0x3b,
  そ: 0x3a,
  た: 0x15,
  ち: 0x17,
  つ: 0x1d,
  て: 0x1f,
  と: 0x1e,
  な: 0x05,
  に: 0x07,
  ぬ: 0x0d,
  ね: 0x0f,
  の: 0x0e,
  は: 0x25,
  ひ: 0x27,
  ふ: 0x2d,
  へ: 0x2f,
  ほ: 0x2e,
  ま: 0x35,
  み: 0x37,
  む: 0x3d,
  め: 0x3f,
  も: 0x3e,
  や: 0x0c,
  ゆ: 0x2c,
  よ: 0x1c,
  ら: 0x11,
  り: 0x13,
  る: 0x19,
  れ: 0x1b,
  ろ: 0x1a,
  わ: 0x04,
  // ゐ: [2,3]
  ゐ: 0x06,
  // ゑ: [2,3,5]。感嘆符と同じ点字
  ゑ: 0x16,
  を: 0x14,
  ん: 0x34,
  っ: 0x02,
  ー: 0x12,
};

// キーボードでの変換用
export const hiraganaKigouTable: { [key: string]: number } = {
  // 空白 []。点字では、よく使われる。指点字では使わない
  "␣": 0x00,
  // 長音 [2,5]
  ー: 0x12,
  // 読点 [5,6]。点字では、スペースが続く。外字符と同じ。指点字では使わない？
  //"、": 0x30,
  // 句点(終止符) [2,5,6]。点字では、スペースが2つ続く。指点字では使わない？
  "。": 0x32,
  // 疑問符 [2,6]
  "？": 0x22,
  // 感嘆符 [2,3,5]
  "！": 0x16,
  // 中黒 [5]。点字では、スペースが続く。濁音符と同じ
  //"・": 0x10,
};

// 指点字表での表示用
export const kigouTable_yubitenjiChart: { [key: string]: number } = {
  // 句点(終止符) [2,5,6]。点字では、スペースが2つ続く。指点字では使わない？
  "。(終止符)": 0x32,
  // 読点 [5,6]。点字では、スペースが続く。外字符と同じ。指点字では使わない？
  // "、": 0x30,
  // 疑問符 [2,6]
  "？(疑問符)": 0x22,
  // 感嘆符 [2,3,5]
  "！": 0x16,
  // 中黒 [5]。点字では、スペースが続く。濁音符と同じ
  "・": 0x10,
  // 第１カギカッコ
  "「（つなぎ符）": 0x24,
  // 通訳者引用符、丸カッコ
  "通訳者引用符": 0x36,
  // 第１カギカッコ
  "「」(第一カギ)": 0x24,
  // 通訳者引用符、丸カッコ
  "丸カッコ": 0x36,
};

export const brailleCodes: { [key: string]: number } = {
  // 濁音符　例）ぎ。中黒と同じ。[5]
  dakuonFu: 0x10,
  // 半濁音符　例）ぴ。[6]
  handakuonFu: 0x20,
  // 拗音符　例）きゃ。[4]
  youonFu: 0x08,
  // 拗濁音符　例）ぎゃ。[4,5]
  youdakuonFu: 0x18,
  // 拗半濁音符　例）ぴゃ。[4,6]
  youhandakuonFu: 0x28,
  // 数符。[3, 4, 5, 6]
  suFu: 0x3c,
  // つなぎ符。[3, 6]
  // (1)数字にあ行、またはら行が続く時に使用する
  // (2)語中で英語→日本語と変化する場合（A型、X線、Gift券、など）。その間につなぎ符を使用
  tsunagiFu: 0x24,
  // 外字符。読点と同じ。[5, 6]
  gaijiFu: 0x30,
  // 外字引用符	
  // 点字で外国語の単語や文を表記する際に、単語の区切りを示すために使用される記号
  // 外字引用符（開始）。[2, 3, 6]
  // 外字引用符（終わり）、「ん」と同じ。[3, 5, 6]
  gaijiinyoFu_kaishi: 0x26,
  gaijiinyoFu_owari: 0x34,
  // 大文字符。[6]
  ohmojiFu: 0x20,
  // 二重大文字符（アルファベットの全部が大文字であることを示す）
  // 大文字符を2回繰り返す
};

// 濁音化マッピングテーブル
export const dakuonMap: { [key: string]: string } = {
    'か': 'が',
    'き': 'ぎ',
    'く': 'ぐ',
    'け': 'げ',
    'こ': 'ご',
    'さ': 'ざ',
    'し': 'じ',
    'す': 'ず',
    'せ': 'ぜ',
    'そ': 'ぞ',
    'た': 'だ',
    'ち': 'ぢ',
    'つ': 'づ',
    'て': 'で',
    'と': 'ど',
    'は': 'ば',
    'ひ': 'び',
    'ふ': 'ぶ',
    'へ': 'べ',
    'ほ': 'ぼ',
    // 特殊音
    'う': 'ゔ',
  };

// 半濁音化マッピングテーブル
export const handakuonMap: { [key: string]: string } = {
    'は': 'ぱ',
    'ひ': 'ぴ',
    'ふ': 'ぷ',
    'へ': 'ぺ',
    'ほ': 'ぽ',
    // 特殊音
    'つ': 'てゅ',
    'ゆ': 'ふゅ',
    'よ': 'ふょ',
};

    // 特殊音（4, 5, 6点）
    // 'つ': 'でゅ',
    // 'ゆ': 'ゔゅ',
    // 'よ': 'ゔょ',

export const youonMap: { [key: string]: string } = {
    // --- 清音の(開)拗音 ---
    // 母音である/a/ /u/ /o/と、その直前の子音の間に、半母音のyが入る音節
    // カ行
    'か': 'きゃ',
    'く': 'きゅ',
    'こ': 'きょ',
    // サ行
    'さ': 'しゃ',
    'す': 'しゅ',
    'そ': 'しょ',
    // タ行
    'た': 'ちゃ',
    'つ': 'ちゅ',
    'と': 'ちょ',
    // ナ行
    'な': 'にゃ',
    'ぬ': 'にゅ',
    'の': 'にょ',
    // ハ行
    'は': 'ひゃ',
    'ふ': 'ひゅ',
    'ほ': 'ひょ',
    // マ行
    'ま': 'みゃ',
    'む': 'みゅ',
    'も': 'みょ',
    // ラ行
    'ら': 'りゃ',
    'る': 'りゅ',
    'ろ': 'りょ',
    // 特殊音（エ段の開拗音）
    // 「ミェ」「リェ」「ギェ」「ヂェ」「ビェ」「ピェ」は、定義されていない
    'え': 'いぇ',
    'け': 'きぇ',
    'せ': 'しぇ',
    'て': 'ちぇ',
    'ね': 'にぇ',
    'へ': 'ひぇ',
  // 特殊音（イ段：子音の取り替え）
    'し': 'すぃ',
    'ち': 'てぃ',
};

export const youdakuonMap: { [key: string]: string } = {
    // --- 濁音の(開)拗音 ---
    // 母音である/a/ /u/ /o/と、その直前の子音の間に、半母音のyが入る音節
    // ガ行
    'か': 'ぎゃ',
    'く': 'ぎゅ',
    'こ': 'ぎょ',
    // ザ行
    'さ': 'じゃ',
    'す': 'じゅ',
    'そ': 'じょ',
    // ダ行
    'た': 'ぢゃ',
    'つ': 'ぢゅ',
    'と': 'ぢょ',
    // バ行
    'は': 'びゃ',
    'ふ': 'びゅ',
    'ほ': 'びょ',
    // 特殊音（え行）
    'せ': 'じぇ',
    // 特殊音（イ段：子音の取り替え）
    'し': 'ずぃ',
    'ち': 'でぃ',
  };

export const youhandakuonMap: { [key: string]: string } = {
  // パ行
  'は': 'ぴゃ',
  'ふ': 'ぴゅ',
  'ほ': 'ぴょ',
};

  // 合拗音（疑問符）
  // 子音・母音の間に半母音wが入る音節のこと。現代日本語（共通語）では消失している
  // 'あ': 'うぁ',（点字図書館の点字表にはない）
  // 'い': 'うぃ',
  // 'え': 'うぇ',
  // 'お': 'うぉ',

  // 'か': 'くぁ',
  // 'き': 'くぃ',
  // 'け': 'くぇ',
  // 'こ': 'くぉ',

  // 'た': 'つぁ',
  // 'ち': 'つぃ',
  // 'て': 'つぇ',
  // 'と': 'つぉ',

  // 'は': 'ふぁ',
  // 'ひ': 'ふぃ',
  // 'へ': 'ふぇ',
  // 'ほ': 'ふぉ',

  // 合拗濁音（句点符）
  // 'か': 'ぐぁ',
  // 'き': 'ぐぃ',
  // 'け': 'ぐぇ',
  // 'こ': 'ぐぉ',

  // 'は': 'ゔぁ',
  // 'ひ': 'ゔぃ',
  // 'へ': 'ゔぇ',
  // 'ほ': 'ゔぉ',

//数値
export const numberTable: { [key: string]: number } = {
  // 1:ひらがなの「あ」、アルファベットのに「a」同じ [1]
  "1": 0x01,

  // 2:ひらがなの「い」、アルファベットのに「b」同じ [1,2]
  "2": 0x03,

  // 3:ひらがなの「う」、アルファベットのに「c」同じ [1,4]
  "3": 0x09,

  // 4:ひらがなの「る」、アルファベットのに「d」同じ [1,4,5]
  "4": 0x19,

  // 5:ひらがなの「ら」、アルファベットのに「e」同じ [1,5]
  "5": 0x11,

  // 6:ひらがなの「え」、アルファベットのに「f」同じ [1,2,4]
  "6": 0x0b,

  // 7:ひらがなの「れ」、アルファベットのに「g」同じ [1,2,4,5]
  "7": 0x1b,

  // 8:ひらがなの「り」、アルファベットのに「h」同じ [1,2,5]

  "8": 0x13,

  // 9:ひらがなの「お」、アルファベットのに「i」同じ [2,4]
  "9": 0x0a,

  // 0:ひらがなの「ろ」、アルファベットのに「j」同じ [2,4,5]
  "0": 0x1a,

  // 小数点 [2]
  ".": 0x02,

  // 位取り点（コンマ）、アポストロフィー [3]
  ",": 0x04
};

//アルファベット（a-z）
export const alphabetTable: { [key: string]: number } = {
  // a:ひらがなの「あ」に同じ。数字の「1」と同じ
  a: 0x01,

  // b:ひらがなの「い」に同じ。数字の「2」と同じ
  b: 0x03,

  // c:ひらがなの「う」に同じ。数字の「3」と同じ
  c: 0x09,

  // d:ひらがなの「る」に同じ。数字の「4」と同じ
  d: 0x19,

  // e:ひらがなの「ら」に同じ。数字の「5」と同じ
  e: 0x11,

  // f:ひらがなの「え」に同じ。数字の「6」と同じ
  f: 0x0b,

  // g:ひらがなの「れ」に同じ。数字の「7」と同じ
  g: 0x1b,

  // h:ひらがなの「り」に同じ。数字の「8」と同じ
  h: 0x13,

  // i:ひらがなの「お」に同じ。数字の「9」と同じ
  i: 0x0a,

  // j:ひらがなの「ろ」に同じ。数字の「0」と同じ
  j: 0x1a,

  // k:ひらがなの「な」に同じ。「1」(=a) に3点を加えたものに同じ。
  k: 0x05,

  // l:ひらがなの「に」に同じ。「2」(=b) に3点を加えたものに同じ。
  l: 0x07,

  // m:ひらがなの「ぬ」に同じ。「3」(=c) に3点を加えたものに同じ。
  m: 0x0d,

  // n:ひらがなの「つ」に同じ。「4」(=d) に3点を加えたものに同じ。
  n: 0x1d,

  // o:ひらがなの「た」に同じ。「5」(=e) に3点を加えたものに同じ。
  o: 0x15,

  // p:ひらがなの「ね」に同じ。「6」(=f) に3点を加えたものに同じ。
  p: 0x0f,

  // q:ひらがなの「て」に同じ。「7」(=g) に3点を加えたものに同じ。
  q: 0x1f,

  // r:ひらがなの「ち」に同じ。「8」(=h) に3点を加えたものに同じ。
  r: 0x17,

  // s:ひらがなの「の」に同じ。「9」(=i) に3点を加えたものに同じ。
  s: 0x0e,

  // t:ひらがなの「と」に同じ。「0」(=j) に3点を加えたものに同じ。
  t: 0x1e,

  // u:ひらがなの「は」に同じ。「1」(=a) に3と6の点を加えたものに同じ。
  u: 0x25,

  // v:ひらがなの「ひ」に同じ。「2」(=b) に3と6の点を加えたものに同じ。
  v: 0x27,

  // w:特殊。ひらがなの「そ」に同じ。「J」に6の点を加えたものに同じ。。
  // ブライユ点字が考案された時点では、点字はフランス語でほとんど用いられないWを除いたため
  w: 0x3a,

  // x:ひらがなの「ふ」に同じ。「3」(=c) に3と6の点を加えたものに同じ。
  x: 0x2d,

  // y:ひらがなの「む」に同じ。「4」(=d) に3と6の点を加えたものに同じ。
  y: 0x3d,

  // z:ひらがなの「ま」に同じ。「5」(=e) に3と6の点を加えたものに同じ。
  z: 0x35,
  // `(グレイヴ)、´(アキュート)、ˆ(サーカム) アクセント符 [4]、0x08（拗音符に同じ）
  // , コンマ [2]、0x02
  ",": 0x02,

  // ; セミコロン [2, 3]、0x06
  ";": 0x06,

  // : コロン [2, 5]、0x12
  ":": 0x12,

  // . ピリオド [2, 5, 6]、0x32
  ".": 0x32,

  // ! 感嘆符 [2, 3, 5]、0x16
  "!": 0x16,

  // ? 疑問符 [2, 3, 6]、0x26
  "?": 0x26,

  // ' アポストロフィ [3]、0x04
  "'": 0x04,

  // - ハイフン [3, 6]、0x24
  "-": 0x24,

  // & アンドマーク [4]、0x08 => [1, 2, 3, 4, 6]、0x2f
  // / スラッシュ  [4, 5, 6]、0x38 => [3, 4]、0x0c
  // –(enダッシュ)、—（emダッシュ） ダッシュ [3, 6]、0x24 => [3, 6]、0x24
  // 点線 [3]、0x04 => [3]、0x04 => [3]、0x04
  // ()丸カッコ [2, 3, 5, 6]、0x36 〜 [2, 3, 5, 6]、0x36
  // []角カッコ [6]、0x20 => [2, 3, 5, 6]、0x36 〜 
  //           [2, 3, 5, 6]、0x36 => [3]、0x04
  // ダブルクォーテンションマーク [2, 3, 6]、0x26 => [3, 5, 6]、0x34
  // --- '…' 直線形（開始記号と終了記号が同じ）
  // --- ‘…’ 曲線形
  "‘": 0x26,
  "’": 0x34,
  // シングルクォーテンションマーク [6]、0x20 => [3, 5, 6]、0x34
  //                           [2, 3, 6]、0x26 => [3]、0x04
  // --- "…" 直線形（開始記号と終了記号が同じ）
  // --- “…” 曲線形
};